selfservicehub/AmadeusComponent/build/classes/main/synapse-config/sequences/PNRAddMultiElements.xml

<?xml version="1.0" encoding="UTF-8"?>
<sequence name="PNRAddMultiElements" trace="disable" xmlns="http://ws.apache.org/ns/synapse">
    <log level="custom">
        <property name="switchlog" value="Entering PNRAddMultiElements Sequence"/>
        <property expression="get-property('MessageID')" name="ESB-MessageID"/>
    </log>
    <payloadFactory media-type="xml">
        <format>
            <soapenv:Envelope xmlns:link="http://wsdl.amadeus.com/2010/06/ws/Link_v1" xmlns:pnr="http://xml.amadeus.com/PNRADD_17_1_1A" xmlns:sec="http://xml.amadeus.com/2010/06/Security_v1" xmlns:ses="http://xml.amadeus.com/2010/06/Session_v3" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
                <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
                    <ses:Session TransactionStatusCode="End">
                        <ses:SessionId>$1</ses:SessionId>
                        <ses:SequenceNumber>$2</ses:SequenceNumber>
                        <ses:SecurityToken>$3</ses:SecurityToken>
                    </ses:Session>
                </soapenv:Header>
                <soapenv:Body>
                    <pnr:PNR_AddMultiElements>
                        <pnr:pnrActions>
                            <pnr:optionCode>11</pnr:optionCode>
                        </pnr:pnrActions>
                        <pnr:dataElementsMaster>
                            <pnr:marker1/>
                            <pnr:dataElementsIndiv>
                                <pnr:elementManagementData>
                                    <pnr:reference>
                                        <pnr:qualifier>OT</pnr:qualifier>
                                        <pnr:number>10</pnr:number>
                                    </pnr:reference>
                                    <pnr:segmentName>RM</pnr:segmentName>
                                </pnr:elementManagementData>
                                <pnr:miscellaneousRemark>
                                    <pnr:remarks>
                                        <pnr:type>RM</pnr:type>
                                        <pnr:freetext>$4</pnr:freetext>
                                    </pnr:remarks>
                                </pnr:miscellaneousRemark>
                            </pnr:dataElementsIndiv>
                        </pnr:dataElementsMaster>
                    </pnr:PNR_AddMultiElements>
                </soapenv:Body>
            </soapenv:Envelope>
        </format>
        <args>
            <arg evaluator="xml" expression="get-property('sessionId')"/>
            <arg evaluator="xml" expression="get-property('sequenceNumber')"/>
            <arg evaluator="xml" expression="get-property('securityToken')"/>
            <arg evaluator="xml" expression="get-property('pnrRemark')"/>
        </args>
    </payloadFactory>
    <property name="messageType" scope="axis2" type="STRING" value="text/xml"/>
    <header name="wsa:Action" scope="default" value="http://xml.amadeus.com/PNRADD_17_1_1A" xmlns:wsa="http://www.w3.org/2005/08/addressing"/>
    <header expression="get-property('MessageID')" name="wsa:MessageID" scope="default" xmlns:wsa="http://www.w3.org/2005/08/addressing"/>
    <header expression="get-property('amadeusEndPoint')" name="wsa:To" scope="default" xmlns:wsa="http://www.w3.org/2005/08/addressing"/>
    <header name="Action" scope="default" value="http://xml.amadeus.com/PNRADD_17_1_1A"/>
    <property name="HTTP_METHOD" scope="axis2" type="STRING" value="POST"/>
    <property name="PRESERVE_WS_ADDRESSING" scope="default" type="STRING" value="true"/>
    <property name="preserveProcessedHeaders" scope="default" type="STRING" value="true"/>
    <header expression="get-property('amadeusEndPoint')" name="To" scope="default"/>
    <log level="full"/>
    <call>
        <endpoint>
            <default format="soap11">
                <timeout>
                    <duration>60000</duration>
                    <responseAction>fault</responseAction>
                </timeout>
                <suspendOnFailure>
                    <initialDuration>2000</initialDuration>
                    <progressionFactor>1.0</progressionFactor>
                    <maximumDuration>3000</maximumDuration>
                </suspendOnFailure>
            </default>
        </endpoint>
    </call>
    <log level="full"/>
    <property expression="$header/awsse:Session/awsse:SessionId/text()" name="sessionId" scope="default" type="STRING" xmlns:awsse="http://xml.amadeus.com/2010/06/Session_v3"/>
    <property expression="$header/awsse:Session/awsse:SequenceNumber/text()" name="sequenceNumber" scope="default" type="STRING" xmlns:awsse="http://xml.amadeus.com/2010/06/Session_v3"/>
    <property expression="$header/awsse:Session/awsse:SecurityToken/text()" name="securityToken" scope="default" type="STRING" xmlns:awsse="http://xml.amadeus.com/2010/06/Session_v3"/>
    <filter regex="200" source="get-property('axis2', 'HTTP_SC')">
        <then>
            <log level="custom">
                <property name="switchlog" value="Amadeus PNRAddMultiElements service call successfull"/>
            </log>
        </then>
        <else>
            <property expression="$body/soap:Fault/faultstring/text()" name="faultString" scope="default" type="STRING" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"/>
            <log level="custom">
                <property name="switchlog" value="Error while invoking the PNRAddMultiElements service"/>
                <property expression="$body/soap:Fault/faultstring/text()" name="faultString" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"/>
            </log>
            <property name="HTTP_SC" scope="axis2" type="STRING" value="200"/>
            <payloadFactory media-type="json">
                <format>
                    	{ "amadeusResponse": {
	            			"resultCode": "201",
	        				"resultMessage": "$ctx:faultString",
							"sessionId" : "$ctx:sessionId",
							"sequenceNumber" : "$ctx:sequenceNumber",
							"securityToken" : "$ctx:securityToken",
	        				"pnrDetails": null
	            			}
            			}
                    </format>
                <args/>
            </payloadFactory>
            <respond/>
        </else>
    </filter>
</sequence>
