ServicesHub/Amadeus/XMLFile1.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <add:MessageID xmlns:add="http://www.w3.org/2005/08/addressing">517f28dc-ee74-4649-8e20-078632f86c04</add:MessageID>
    <add:Action xmlns:add="http://www.w3.org/2005/08/addressing">http://webservices.amadeus.com/PNRADD_17_1_1A</add:Action>
    <add:To xmlns:add="http://www.w3.org/2005/08/addressing">https://nodeD2.production.webservices.amadeus.com/1ASIWFMOFMJ</add:To>
    <awsse:Session TransactionStatusCode="InSeries" xmlns:awsse="http://xml.amadeus.com/2010/06/Session_v3">
      <awsse:SessionId>02FWSIMU7V</awsse:SessionId>
      <awsse:SequenceNumber>2</awsse:SequenceNumber>
      <awsse:SecurityToken>2F5SKLIWE54JZ1C9QSAELXBRJL</awsse:SecurityToken>
    </awsse:Session>
  </s:Header>
  <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <PNR_AddMultiElements xmlns="http://xml.amadeus.com/PNRADD_17_1_1A">
      <pnrActions>
        <optionCode>0</optionCode>
      </pnrActions>
      <travellerInfo>
        <elementManagementPassenger>
          <reference>
            <qualifier>PR</qualifier>
            <number>1</number>
          </reference>
          <segmentName>NM</segmentName>
        </elementManagementPassenger>
        <passengerData>
          <travellerInformation>
            <traveller>
              <surname>PARTHASARATHY</surname>
              <quantity>1</quantity>
            </traveller>
            <passenger>
              <firstName>NALINI</firstName>
              <type>ADT</type>
            </passenger>
          </travellerInformation>
        </passengerData>
      </travellerInfo>
      <travellerInfo>
        <elementManagementPassenger>
          <reference>
            <qualifier>PR</qualifier>
            <number>2</number>
          </reference>
          <segmentName>NM</segmentName>
        </elementManagementPassenger>
        <passengerData>
          <travellerInformation>
            <traveller>
              <surname>A</surname>
              <quantity>1</quantity>
            </traveller>
            <passenger>
              <firstName>VIJAYA</firstName>
              <type>ADT</type>
            </passenger>
          </travellerInformation>
        </passengerData>
      </travellerInfo>
      <travellerInfo>
        <elementManagementPassenger>
          <reference>
            <qualifier>PR</qualifier>
            <number>3</number>
          </reference>
          <segmentName>NM</segmentName>
        </elementManagementPassenger>
        <passengerData>
          <travellerInformation>
            <traveller>
              <surname>KRISHNASWAMY</surname>
              <quantity>1</quantity>
            </traveller>
            <passenger>
              <firstName>KUMAR</firstName>
              <type>ADT</type>
            </passenger>
          </travellerInformation>
        </passengerData>
      </travellerInfo>
      <dataElementsMaster>
        <marker1></marker1>
        <dataElementsIndiv>
          <elementManagementData>
            <reference>
              <qualifier>PT</qualifier>
              <number>1</number>
            </reference>
            <segmentName>SSR</segmentName>
          </elementManagementData>
          <serviceRequest>
            <ssr>
              <type>DOCS</type>
              <status>HK</status>
              <quantity>1</quantity>
              <companyId>AI</companyId>
              <indicator>P01</indicator>
              <freetext>----07Jul00-F--Parthasarathy-Nalini</freetext>
            </ssr>
          </serviceRequest>
          <referenceForDataElement>
            <reference>
              <qualifier>PR</qualifier>
              <number>1</number>
            </reference>
          </referenceForDataElement>
        </dataElementsIndiv>
        <dataElementsIndiv>
          <elementManagementData>
            <reference>
              <qualifier>PT</qualifier>
              <number>2</number>
            </reference>
            <segmentName>SSR</segmentName>
          </elementManagementData>
          <serviceRequest>
            <ssr>
              <type>DOCS</type>
              <status>HK</status>
              <quantity>1</quantity>
              <companyId>AI</companyId>
              <indicator>P01</indicator>
              <freetext>----07Jul00-F--A-Vijaya</freetext>
            </ssr>
          </serviceRequest>
          <referenceForDataElement>
            <reference>
              <qualifier>PR</qualifier>
              <number>2</number>
            </reference>
          </referenceForDataElement>
        </dataElementsIndiv>
        <dataElementsIndiv>
          <elementManagementData>
            <reference>
              <qualifier>PT</qualifier>
              <number>3</number>
            </reference>
            <segmentName>SSR</segmentName>
          </elementManagementData>
          <serviceRequest>
            <ssr>
              <type>DOCS</type>
              <status>HK</status>
              <quantity>1</quantity>
              <companyId>AI</companyId>
              <indicator>P01</indicator>
              <freetext>----07Jul00-M--Krishnaswamy-Kumar</freetext>
            </ssr>
          </serviceRequest>
          <referenceForDataElement>
            <reference>
              <qualifier>PR</qualifier>
              <number>3</number>
            </reference>
          </referenceForDataElement>
        </dataElementsIndiv>
        <dataElementsIndiv>
          <elementManagementData>
            <reference>
              <qualifier>OT</qualifier>
              <number>4</number>
            </reference>
            <segmentName>RF</segmentName>
          </elementManagementData>
          <freetextData>
            <freetextDetail>
              <subjectQualifier>3</subjectQualifier>
              <type>P22</type>
            </freetextDetail>
            <longFreetext>FlightsMojoIN</longFreetext>
          </freetextData>
        </dataElementsIndiv>
        <dataElementsIndiv>
          <elementManagementData>
            <reference>
              <qualifier>OT</qualifier>
              <number>5</number>
            </reference>
            <segmentName>AP</segmentName>
          </elementManagementData>
          <freetextData>
            <freetextDetail>
              <subjectQualifier>3</subjectQualifier>
              <type>4</type>
            </freetextDetail>
            <longFreetext>7395999072</longFreetext>
          </freetextData>
        </dataElementsIndiv>
        <dataElementsIndiv>
          <elementManagementData>
            <reference>
              <qualifier>OT</qualifier>
              <number>6</number>
            </reference>
            <segmentName>AP</segmentName>
          </elementManagementData>
          <freetextData>
            <freetextDetail>
              <subjectQualifier>3</subjectQualifier>
              <type>3</type>
            </freetextDetail>
            <longFreetext>FlightsMojoIN  - A</longFreetext>
          </freetextData>
        </dataElementsIndiv>
        <dataElementsIndiv>
          <elementManagementData>
            <reference>
              <qualifier>OT</qualifier>
              <number>7</number>
            </reference>
            <segmentName>AP</segmentName>
          </elementManagementData>
          <freetextData>
            <freetextDetail>
              <subjectQualifier>3</subjectQualifier>
              <type>P02</type>
            </freetextDetail>
            <longFreetext>kaushikkumar0710@gmail.com</longFreetext>
          </freetextData>
        </dataElementsIndiv>
        <dataElementsIndiv>
          <elementManagementData>
            <reference>
              <qualifier>OT</qualifier>
              <number>8</number>
            </reference>
            <segmentName>TK</segmentName>
          </elementManagementData>
          <ticketElement>
            <ticket>
              <indicator>OK</indicator>
            </ticket>
          </ticketElement>
        </dataElementsIndiv>
        <dataElementsIndiv>
          <elementManagementData>
            <reference>
              <qualifier>OT</qualifier>
              <number>9</number>
            </reference>
            <segmentName>RM</segmentName>
          </elementManagementData>
          <miscellaneousRemark>
            <remarks>
              <type>RM</type>
              <freetext>ticket amt $2622.00 ///tax $2778.00 ///mco $-55.00</freetext>
            </remarks>
          </miscellaneousRemark>
        </dataElementsIndiv>
        <dataElementsIndiv>
          <elementManagementData>
            <reference>
              <qualifier>OT</qualifier>
              <number>10</number>
            </reference>
            <segmentName>AI</segmentName>
          </elementManagementData>
          <accounting>
            <account>
              <number>FMLDFW</number>
            </account>
          </accounting>
        </dataElementsIndiv>
        <dataElementsIndiv>
          <elementManagementData>
            <reference>
              <qualifier>OT</qualifier>
              <number>11</number>
            </reference>
            <segmentName>RM</segmentName>
          </elementManagementData>
          <miscellaneousRemark>
            <remarks>
              <type>RM</type>
              <freetext>Booking Source: FLIGHTSMOJO WEBSITE-1037</freetext>
            </remarks>
          </miscellaneousRemark>
        </dataElementsIndiv>
      </dataElementsMaster>
    </PNR_AddMultiElements>
  </s:Body>
</s:Envelope>